# задание № 1:  словарь изменяемый тип
# задание № 2
# d = {'a': 1, 'b': 2} - вывести значение ключа b
d = {'a': 1, 'b': 2}
print(d['b'])
# задание № 3
# d = {'a': 1, 'b': 2} - вывести все ключи
d = {'a': 1, 'b': 2}
print(d.keys())
# задание № 4
# d = {'a': 1, 'b': 2} - вывести все значения
d = {'a': 1, 'b': 2}
print(d.values())
# задание № 5
# d = {'a': 1, 'b': 2} - добавить в словарь ключ ‘t’ со значением 1000
d = {'a': 1, 'b': 2}
d['t'] = 1000
print(d)
# задание № 6
# есть список a = [1,2,3,4] сделать из него словарь d = {1: None, 2: None, 3: None, 4: None}
a = [1, 2, 3, 4]
d = dict.fromkeys(a)
print(d)
