# задание № 1
# какие есть числа в питоне?
# числа бывают целыми (int) и с плавующей точкой  (float)

# задание № 2
# сложи два числа 1232 и 2321
a = 1232 + 2321
print(a)

# задание № 3
# умножь два числа 1232 и 2321
a = 1232 * 2321
print(a)

# задание № 4
# возведи число 1232 в степень 32
a = 1232 ** 32
print(a)

# задание № 5
# подели 1232 на 13
a = 1232 // 13
b = 1232 / 13
print(a, '\n', b)

# задание № 6
# найди остаток от деления числа 1232 на 37
a = 1232 % 13
print(a)

# задание № 7
# вычти из числа 1232 число 2321
a = 1232 - 2321
print(a)

# задание № 8
# преобразуй число 1232 в строку ‘1232’
a = str(1232)
print(a)

# задание № 9
# преобразуй строку ‘1232’ в число 1232
a = int('1232')
print(a)

# задание № 10
# преобразуй строку ‘1232’ в число 1232.0 - тип float
a = float('1232')
print(a)
